---
kind: method
id: M:Autodesk.Revit.DB.Infrastructure.Alignment.GetAlignments(Autodesk.Revit.DB.Document)
source: html/baa67b6f-82df-1d4b-3c38-6cea587d3ae9.htm
---
# Autodesk.Revit.DB.Infrastructure.Alignment.GetAlignments Method

Returns all alignments in the given document.

## Syntax (C#)
```csharp
public static ICollection<Alignment> GetAlignments(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document for which the alignments are returned.